****** setf can assign a symbol from a list
setf is from common lisp.  One advantage it has over setq is that the symbol arg can be something other than a symbol literal. For instance, it can be a symbol extracted from a list:

#+BEGIN_SRC emacs-lisp :tangle yes
(setq a '(1 2 3))
(setf (car a) 15)
a
#+END_SRC

#+RESULTS:
| 15 | 2 | 3 |

****** setq cannot
You cannot do this with setq:

#+BEGIN_SRC emacs-lisp :tangle yes
(setq a '(1 2 3))
(setq (car a) 14)
a
#+END_SRC

#+RESULTS:
Wrong type argument: symbolp (car a)

**** Problem: defvar doesn't seem to update the variable.

A) We start of making sure symbol 'a is not defined
#+BEGIN_SRC emacs-lisp :tangle yes
(makunbound 'a)
a
#+END_SRC

#+RESULTS:
Symbols value as a variable is void: a

B) Then we set it to a value
#+BEGIN_SRC emacs-lisp :tangle yes
(defvar a 1)
a
#+END_SRC

#+RESULTS:
: 1

C) Everything is fine so far.  Now we decide to set a to 2:

#+BEGIN_SRC emacs-lisp :tangle yes
(defvar a 2)
a
#+END_SRC

#+RESULTS:
: 1

D) Wait!  it's still set to 1.  What's wrong here?
When I was first learning elsip this really confused me.  And while it still possible to set the variable using 'setq:

#+BEGIN_SRC emacs-lisp :tangle yes
(setq a 2)
#+END_SRC

#+RESULTS:
: 2

I was really trying to understand how things worked in elisp.  And if there were two functions I though I intuitvely understood in elisp it's 'setvar and 'setconst.  I thought maybe the REPL had one set of values and the runtime another, and maybe at runtime it was being set to two etc.

E) To add insult to injury, defconst, which you thing wouldn't let you change it, is easily changeable:
#+BEGIN_SRC emacs-lisp :tangle yes
(defconst b 1)
b
#+END_SRC

#+RESULTS:
: 1

#+BEGIN_SRC emacs-lisp :tangle yes
(defconst b 2)
b
#+END_SRC

#+RESULTS:
: 2

E) so defvar, asides from the initial assignment, is actling like what I though 'defconst should be working like, and 'defconst was acting like 'defvar.

What gives?

**** Analysis:
Interactive is a marker and helper function for functions you want to be runnable from the minibuffer (M-x), as well as still be able to run from a script via the API.

The following can be run from a script:
#+BEGIN_SRC emacs-lisp :tangle yes
(defun vt-foo (name)
  "demo function"
  (interactive "sname: ")
  (message (format "your name is %s" name)))

(vt-foo "steve")
#+END_SRC

#+RESULTS:
: your name is steve

But also from the minibuffer.

If you do C-h f "vt-foo", you'll notice the function is marked as "interactive"
#+BEGIN_SRC emacs-lisp :tangle yes
(defun vt-foo-2 (name)
  ;;(interactive "sname: ")
  (message (format "your second name is %s" name))
  )
#+END_SRC

This function cannot be run from mini-buffer.
Also note how running C-h a "foo" does not show this function.  You need to run C-u C-h a "foo" in order to see it.

